Revit 2026 API

# CurtainGridGetUnlockedMullionIds Method

---

Gets all ElementIds of the unlocked mullions of the curtain grid.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ICollection<ElementId> GetUnlockedMullionIds()
```
```vb
Public Function GetUnlockedMullionIds As ICollection(Of ElementId)
```
```cpp
public:
ICollection<ElementId^>^ GetUnlockedMullionIds()
```
```fsharp
member GetUnlockedMullionIds : unit -> ICollection<ElementId>
```

#### Return Value

ICollectionElementIdThe unlocked mullion ElementIds

ElementIds are of Mullion Elements.

#### Reference

CurtainGrid Class

Autodesk.Revit.DB Namespace